[
  {
    "q": "Який видатний українець став першим нобелівським лауреатом (1908 р.), що народився на території сучасної України, за відкриття явища фагоцитозу (поглинання клітинами бактерій)?",
    "options": [
      "Данило Заболотний",
      "Ілля Мечников",
      "Олександр Палладін",
      "Микола Амосов"
    ],
    "answer": 1
  },
  {
    "q": "Які твердження є правильними щодо родини Симиренків та їхнього внеску в біологію?",
    "options": [
      "Левко Симиренко створив «Ренет Симиренка»",
      "Вони заснували одну з найбільших у Європі помологічних колекцій (сортів плодових дерев)",
      "Створили перший у світі антибіотик",
      "Досліджували виключно зернові культури"
    ],
    "answer": [0, 1],
    "type": "multiple"
  },
  {
    "q": "На фото зображено сорт яблук, що став візитівкою України. Хто є автором фундаментальної праці «Помологія» та описав цей сорт?",
    "options": [
      "Василь Ремесло",
      "Левко Симиренко",
      "Олена Алексєєва",
      "Іван Мічурін"
    ],
    "answer": 1,
    "type": "image",
    "image": "images/renet_symyrenko.webp"
  },
  {
    "q": "Який український генетик першим у світі довів, що мутації в живих організмах можна викликати за допомогою звичайної молекули ДНК (хімічний мутагенез)?",
    "options": [
      "Микола Вавилов",
      "Сергій Гершензон",
      "Василь Ремесло",
      "Левко Симиренко"
    ],
    "answer": 1
  },
  {
    "q": "Яка вчена розробила методику створення односім’яного цукрового буряка, що дозволило повністю механізувати його вирощування (не потрібно проривати вручну)?",
    "options": [
      "Олена Алексєєва",
      "Марія Бордонос",
      "Наталія Гринчак",
      "Марія Завадська"
    ],
    "answer": 1
  },
  {
    "q": "Сергій Гершензон — «український Дарвін» — ще у 1930-х роках висунув гіпотезу, яка пізніше підтвердилася. Що саме він досліджував?",
    "options": [
      "Здатність ДНК передавати генетичну інформацію (хімічний мутагенез)",
      "Методи щеплення плодових дерев",
      "Схрещування пшениці та жита",
      "Використання вірусів як біологічної зброї"
    ],
    "answer": 0
  },
  {
    "q": "Який український селекціонер створив сорт пшениці «Миронівська-808», що став найпоширенішим сортом у світі в 70-х роках XX століття?",
    "options": [
      "Василь Юр’єв",
      "Василь Ремесло",
      "Григорій Сенченко",
      "Платон Симиренко"
    ],
    "answer": 1
  },
  {
    "q": "Григорій Сенченко відомий тим, що першим у світі створив сорти особливої технічної культури, яка не містить наркотичних речовин. Про яку рослину йдеться?",
    "options": [
      "Гречка",
      "Коноплі",
      "Тютюн",
      "Цукровий буряк"
    ],
    "answer": 1
  },
  {
    "q": "На фото зображено структуру, яку досліджував український біохімік Олександр Палладін. Він став засновником світової школи нейрохімії. Що було основним об'єктом його досліджень?",
    "options": [
      "М'язова тканина",
      "Головний мозок",
      "Система травлення",
      "Кров людини"
    ],
    "answer": 1,
    "type": "image",
    "image": "images/human_brain_neurochemistry.jpg"
  },
  {
    "q": "Оберіть вчених, які зробили значний внесок у розвиток української генетики та селекції:",
    "options": [
      "Сергій Гершензон",
      "Василь Ремесло",
      "Михайло Кравчук",
      "Левко Симиренко"
    ],
    "answer": [0, 1, 3],
    "type": "multiple"
  },
  {
    "q": "Цей український вчений присвятив життя вивченню старіння та сполучної тканини. Його винахід — спеціальна сироватка (АЦС) — масово використовувався під час Другої світової війни для швидкого загоєння переломів та ран. Хто це?",
    "options": [
      "Олександр Богомолець",
      "Ілля Мечников",
      "Данило Заболотний",
      "Олександр Палладін"
    ],
    "answer": 0
  },
  {
    "q": "На фото зображено бактеріофагів (віруси, що вбивають бактерії). Дослідження яких українських мікробіологів дозволили використовувати їх як ліки замість антибіотиків?",
    "options": [
      "Київська школа мікробіології (Д. Заболотний та ін.)",
      "Харківська школа помології",
      "Миронівський інститут пшениці",
      "Одеський інститут філатова"
    ],
    "answer": 0,
    "type": "image",
    "image": "images/bacteriophage.jpg"
  }
]