[
  {
    "q": "Який український математик є автором формули, що пов'язує інтеграл по об'єму з інтегралом по поверхні, яка є фундаментальною у векторному аналізі?",
    "options": [
      "Михайло Кравчук",
      "Михайло Остроградський",
      "Георгій Вороний",
      "Микола Боголюбов"
    ],
    "answer": 1
  },
  {
    "q": "Хто з українських вчених розробив метод діаграм, що дозволяють розбивати площину на ділянки за принципом близькості до точок, які зараз широко використовуються в комп'ютерній графіці та ШІ?",
    "options": [
      "Михайло Кравчук",
      "Георгій Вороний",
      "Віктор Глушков",
      "Марк Крейн"
    ],
    "answer": 1
  },
  {
    "q": "Які з перелічених здобутків належать «батьку» української комп'ютерної техніки Віктору Глушкову?",
    "options": [
      "Створення першої в континентальній Європі ЕОМ (МЕОМ)",
      "Розробка теорії цифрових автоматів",
      "Винахід методу скінченних елементів",
      "Ідея створення загальнодержавної автоматизованої системи обліку (ЗДАС)"
    ],
    "answer": [1, 3],
    "type": "multiple"
  },
  {
    "q": "Мало хто знає, що першу у світі мову програмування високого рівня ('Адресну мову') створила українка за 2 роки до появи Fortran. Як звали цю дослідницю?",
    "options": [
      "Марина В'язовська",
      "Катерина Ющенко",
      "Олена Терлецька",
      "Віра Глушкова"
    ],
    "answer": 1
  },
  {
    "q": "Який видатний математик з Житомирщини створив поліноми, що були використані США для розробки методів стиснення цифрових даних та телебачення?",
    "options": [
      "Михайло Кравчук",
      "Анатолій Скороход",
      "Володимир Левицький",
      "Микола Чайковський"
    ],
    "answer": 0
  },
  {
    "q": "На фото зображена складна геометрична фігура (фрактал). Дослідження якого українського математика про «співіснування циклів» стали фундаментом для вивчення таких структур і теорії хаосу?",
    "options": [
      "Михайло Кравчук",
      "Олександр Шарковський",
      "Володимир Левицький",
      "Микола Боголюбов"
    ],
    "answer": 1,
    "type": "image",
    "image": "images/fractal_chaos.jpg"
  },
  {
    "q": "Оберіть вірні твердження щодо Марини В'язовської — другої жінки в історії, яка отримала медаль Філдса (аналог Нобелівської премії для математиків): ",
    "options": [
      "Розв'язала задачу про найщільніше пакування куль у 8-вимірному та 24-вимірному просторах",
      "Народилася та навчалася в Києві",
      "Є авторкою теорії нелінійних коливань",
      "Отримала нагороду за розвиток кібернетики"
    ],
    "answer": [0, 1],
    "type": "multiple"
  },
  {
    "q": "На фото зображено візуалізацію задачі, яку розв'язала українка Марина В'язовська. Про яку математичну проблему йдеться?",
    "options": [
      "Квадратура круга",
      "Найщільніше пакування куль",
      "Проблема чотирьох фарб",
      "Гіпотеза Пуанкаре"
    ],
    "answer": 1,
    "type": "image",
    "image": "images/sphere_packing.png"
  },
  {
    "q": "Хто з українських вчених вважається засновником сучасної нелінійної механіки та створив метод усереднення для диференціальних рівнянь?",
    "options": [
      "Микола Боголюбов",
      "Олексій Погорєлов",
      "Йосип Гіхман",
      "Микола Крилов"
    ],
    "answer": 0
  },
  {
    "q": "Який вчений, що народився на Харківщині, розв'язав четверту проблему Гільберта та написав один з найкращих підручників з геометрії?",
    "options": [
      "Олександр Шарковський",
      "Олексій Погорєлов",
      "Марк Крейн",
      "Анатолій Скороход"
    ],
    "answer": 1
  },
  {
    "q": "Хто був засновником першого в Україні математичного товариства (у Харкові) та зробив великий внесок у теорію стійкості систем?",
    "options": [
      "Олександр Ляпунов",
      "Михайло Кравчук",
      "Михайло Остроградський",
      "Георгій Вороний"
    ],
    "answer": 0
  },
  {
    "q": "На фото зображено геометричну структуру, яка використовується в архітектурі та IT для поділу простору. На честь якого українського математика вона названа?",
    "options": [
      "Михайло Кравчук",
      "Георгій Вороний",
      "Олексій Погорєлов",
      "Михайло Остроградський"
    ],
    "answer": 1,
    "type": "image",
    "image": "images/voronoi_tessellation.jpg"
  }
]